##  Python Variable Types Example

In this example, we are creating three types of variables:
- **Float Variable** ‚Üí `counter = 100.00`
- **Integer Variable** ‚Üí `miles = 100`
- **String Variable** ‚Üí `name = "Aqsa"`
We will print all the variable values using the `print()` function.

In [3]:
counter = 100.00 
miles = 100   
name = "Aqsa" 

print(counter)
print(miles)
print(name)

100.0
100
Aqsa

## Integer Example in Python

In this example, we are assigning the value `2` to a variable.  
This value is an **integer**, which means it is a whole number (without any decimal point).

In [4]:
2

2

## Simple Addition in Python

In this example, we are adding two integers:  
**2 + 3**
The `+` operator is used for **addition** in Python.

In [5]:
2+3

5

## Adding Two Float Numbers in Python

In this example, we are adding two **float** values:
**2.3 + 5.5**

- Both numbers have decimal points, so they are **float** types.
- The `+` operator adds them.

In [6]:
2.3+5.5

7.8

## Exponentiation in Python

In this example, we are using the exponentiation operator `**`:
**2 \*\* 2**
- `**` means "raised to the power".
- So, `2**2` means **2 raised to the power of 2**, which is:
 2 √ó 2 = 4

In [7]:
2**2

4

## Printing Multiple String Variables in Python

In this example, we are:
- Declaring two **string** variables:
  - `name = 'Aqsa'`
  - `university = "Comsats"`
- Using the `print()` function to **display both values together**.
The `print()` function automatically adds a space between the two values.

In [8]:
name = 'Aqsa'
university = "Comsats"

print(name, university)

Aqsa Comsats

## String Indexing and Slicing in Python

In this example, we are working with a string variable:
`stringVariable = 'Hello World'`
- **Indexing:**  
  `stringVariable[0]` ‚Üí Gives the first character of the string ‚Üí **H**
- **Slicing:**  
  `stringVariable[1:5]` ‚Üí Gives characters from index 1 to 4 (not including 5), which is ‚Üí **ello**
### Note:
- Indexing starts from **0** in Python.
- In slicing, the **start index is included** but the **end index is excluded**.

In [10]:
stringVariable = 'Hello World'
print("stringVariable[0]:", stringVariable[0])
print("stringVariable[1:5]:", stringVariable[1:5])

stringVariable[0]: H
stringVariable[1:5]: ello

## Updating a String Using Slicing and Concatenation

In this example, we are modifying the string:
`stringVariable = "Hello World"`

- `stringVariable[:6]` ‚Üí This gives the first 6 characters of the original string ‚Üí **"Hello "**
- Then we add (concatenate) `"Python"` to it
- Final string becomes ‚Üí **"Hello Python"**
  
We will display this updated string using the `print()` function.

In [11]:
stringVariable = "Hello World"
stringVariable = stringVariable[:6] + "Python"
print("Updated string: ", stringVariable)

Updated string:  Hello Python

## Deleting a Variable Using `del` in Python

In this example, we are working with a string:
`stringVariable = "Hello World"`
- First, we assign a string to the variable:  
  `stringVariable = "Hello World"`
- Then, we print the variable:  
  `print(stringVariable)` ‚Üí This prints **Hello World**
- Next, we delete the variable using the `del` keyword:  
  `del stringVariable`
- Finally, we try to print it again using:  
  `print(stringVariable)`
### Error Explanation:
After using `del stringVariable`, the variable is **removed from memory**.
So when we try to print it again, Python throws the following error:

In [12]:
stringVariable = "Hello World"
print (stringVariable)
del stringVariable
print (stringVariable)

Hello World

NameError: name 'stringVariable' is not defined

## String Concatenation in Python

In this example, we are joining two strings using the `+` operator.
- We assign a string to a variable:  
  `variable = "Hello"`
- Then we concatenate `"Python"` with the variable:  
  `variable + "Aqsa"`
- The result will be:  
  `"HelloAqsa"` (no space between them)
If we want a space between the words, we can write:  
`variable + " Aqsa"` ‚Üí Result: `"Hello Aqsa"`

In [15]:
variable = "Hello"
print(variable+"Aqsa")

HelloAqsa

## String Repetition in Python Using `*` Operator

In this example, we are repeating a string multiple times using the `*` operator.
- We assign a string to a variable:  
  `variable = "Hello"`
- Then we repeat that string **3 times** using:  
  `variable * 3`
- The output will be:  
  `"AqsaAqsaAqsa"`
### Note:
- The `*` operator repeats the string as many times as you specify.
- If you want space between repetitions, use:  
  `(variable + " ") * 3` ‚Üí Output: `"Aqsa Aqsa Aqsa "`

In [16]:
variable = "Aqsa"
print(variable*3)

AqsaAqsaAqsa

## String Indexing Example in Python

In this example, we are accessing a single character from a string using **indexing**.
- Assigning a string to a variable:  
  `variable = "Hello"`
- Accessing the character at index `1`:  
  `print(variable[1])`
###  How Indexing Works:
- Indexing in Python starts from **0**
- `"Hello"` has the following indexes:

  | H | e | l | l | o |
  |---|---|---|---|---|
  | 0 | 1 | 2 | 3 | 4 |

So, `variable[1]` returns ‚Üí **e**

In [17]:
variable = "Hello"
print(variable[1])

e

## String Slicing Example in Python

In this example, we are extracting a **portion** of a string using slicing.
- Assigning a string to a variable:  
  `variable = "Hello"`
- Using slicing:  
  `variable[1:3]` ‚Üí This will extract characters from **index 1 to 2** (3 is excluded)
So, `variable[1:3]` returns ‚Üí **"el"**

In [18]:
variable = "Hello"
print(variable[1:3])

el

## Checking Membership in a String using `in` Operator

In this example, we are using the **`in` operator** to check if a character exists inside a string.
- Assigning a string to a variable:  
  `variable = "Hello"`
- Using `'H' in variable` to check if **'H'** is present in `"Hello"`
- This returns a **Boolean value** ‚Üí `True` or `False`

### How it works:
- `'H' in "Hello"` ‚Üí ‚úÖ Yes, 'H' **is present**, so it returns ‚Üí `True`
- If we wrote `'z' in "Hello"` ‚Üí ‚ùå 'z' is **not present**, so it returns ‚Üí `False`

In [19]:
variable = "Hello"
print('H' in variable)

True

## Checking Absence in a String using `not in` Operator

In this example, we are using the **`not in` operator** to check if a character **is not present** in a string.
- Assigning a string to a variable:  
  `variable = "Hello"`
- Using `'G' not in variable` ‚Üí to check if **'G' is NOT in "Hello"**
### How it works:
- `'G' not in "Hello"` ‚Üí ‚úÖ Yes, 'G' is **not present**, so it returns ‚Üí `True`
- `'H' not in "Hello"` ‚Üí ‚ùå 'H' **is present**, so it returns ‚Üí `False`

In [21]:
variable = "Hello"
print('H' not in variable)

False

## String Formatting using `%` Operator in Python

In this example, we are formatting a string using the old-style `%` operator.
- Using the following format string:  
  `"My name is %s and age is %d kg!"`
- `%s` ‚Üí Placeholder for a **string**  
- `%d` ‚Üí Placeholder for an **integer**
- The values `("Aqsa", 20)` are inserted into the placeholders in order.
### Note:
- %s is replaced with "Aqsa"
- %d is replaced with 20

In [23]:
 print ("My name is %s and age is %d kg!" % ("Aqsa",20))

My name is Aqsa and age is 20 kg!

## Creating and Printing a List in Python

In this example, we are creating a list named `list1` containing two elements.
- Creating a list with two values:
  `list1 = ['Mehvish', '1880']`
- The list contains:
  - `'Mehvish'` ‚Üí a string
  - `'1880'` ‚Üí another string
- We use `print(list1)` to display the entire list.

### Note:
- Lists in Python are created using square brackets `[ ]`
- They can store multiple values of any type (string, integer, float, etc.)
- Indexing starts from **0**, so:
  - `list1[0]` ‚Üí `'Mehvish'`
  - `list1[1]` ‚Üí `'1880'`

In [24]:
 list1 = ['Mehvish','1880']
print(list1)

['Mehvish', '1880']

## List Indexing and Slicing in Python

In this example, we are working with two lists:
`list1 = ['physics', 'chemistry', 1997, 2000]`  
`list2 = [1, 2, 3, 4, 5, 6, 7]`
- Accessing the **first element** of `list1` using `list1[0]`
- Accessing a **slice of list2** from index 1 to 4 using `list2[1:5]`

### Note:
- Indexing in Python starts from **0**
- `list1[0]` gives the **first item** ‚Üí `'physics'`
- `list2[1:5]` returns elements from **index 1 to 4** (5 is excluded)
- Slicing syntax is: `list[start:stop]`

In [25]:
list1 = ['physics', 'chemistry', 1997, 2000];
list2 = [1, 2, 3, 4, 5, 6, 7 ];
print ("list1[0]: ", list1[0])
print ("list2[1:5]: ", list2[1:5])

list1[0]:  physics
list2[1:5]:  [2, 3, 4, 5]

## Updating and Appending in a Python List

In this example, we are performing two operations on a list:
`list1 = ['physics', 'chemistry', 1997, 2000]`
- **Updating an element**:  
  `list1[1] = "computer science"`  
  ‚Üí This changes the second element `'chemistry'` to `'computer science'`
- **Appending an element**:  
  `list1.append('Computer Science')`  
  ‚Üí This adds `'Computer Science'` to the **end** of the list
  
### Note:
- `list[index] = new_value` ‚Üí is used to **update** an element at a specific position.
- `.append(value)` ‚Üí is used to **add a new item** at the **end** of the list.
- Lists in Python are **mutable**, which means we can change their content.

In [26]:
list1 = ['physics', 'chemistry', 1997, 2000];
list1[1] = "computer science"
print(list1)
list1.append('Computer Science')
print(list1)

['physics', 'computer science', 1997, 2000]
['physics', 'computer science', 1997, 2000, 'Computer Science']

## Deleting an Element from a List using `del`

In this example, we are deleting a value from a list at a specific index using the `del` keyword.
`list1 = ['physics', 'chemistry', 1997, 2000]`
- First, we print the original list using `print(list1)`
- Then, we delete the element at index `2` using:  
  `del list1[2]`
- Finally, we print the list again to see the updated version
  
### Note:
- The `del` keyword is used to **delete an element at a specific index** from a list.
- Indexing starts at `0`, so:
  - `list1[2]` refers to `1997`
- After deletion, the list size decreases by 1.

In [27]:
 list1 = ['physics', 'chemistry', 1997, 2000];
print (list1)
del list1[2];
print ("After deleting value at index 2 : ")
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 'chemistry', 2000]

## Removing a Specific Element from a List using `remove()`

In this example, we are deleting an element **by value** from a list using the `remove()` method.
`list1 = ['physics', 'chemistry', 1997, 2000]`
- First, printing the original list using `print(list1)`
- Using `list1.remove('chemistry')` to remove the **value** `'chemistry'` from the list
- Then printing the updated list

### Note:

- `remove()` deletes the **first matching value** in the list (not by index).
- If the value does not exist, Python will raise a `ValueError`.
- Unlike `del list1[2]`, which deletes by **index**, `remove()` deletes by **value**.

In [28]:
list1 = ['physics', 'chemistry', 1997, 2000];
print (list1)
list1.remove('chemistry')
print ("After deleting value at index 2 : ")
print (list1)

['physics', 'chemistry', 1997, 2000]
After deleting value at index 2 :
['physics', 1997, 2000]

## Accessing Values from a Dictionary in Python

In this example, we are working with a dictionary:
`dict = {'Name': "Mehvish", 'Depart': "BCS", 'Batch': 2014}`
- Creating a dictionary with 3 key-value pairs:
  - `'Name'` ‚Üí `"Aqsa"`
  - `'Depart'` ‚Üí `"BS IET"`
  - `'Batch'` ‚Üí `2021`
- Accessing the value of the `'Name'` key using:  
  `dict['Name']`
  
### Note:

- Dictionaries in Python store **data in key-value pairs** inside curly braces `{ }`
- You can access values using the **key name** in square brackets:  
  `dictionary_name['key']`
- If the key does not exist, Python throws a `KeyError`

üìå Tip: Avoid using the word `dict` as a variable name ‚Äî it's a built-in Python type.  
Better to use a name like `student` or `info`.

In [29]:
dict = {'Name':"Aqsa", 'Depart': "BS IET", 'Batch': 2021}
print (dict['Name'])

Aqsa

## Updating and Adding Elements in a Python Dictionary

We are working with a dictionary:
`dict = {'Name': "Aqsa", 'Depart': "BCS", 'Batch': 2014
- First, we print the original dictionary using `print(dict)`
- Then, we update the value of the `'Batch'` key:  
  `dict['Batch'] = "Fall 2021"` ‚Üí Replaces `2014` with `"Fall 2021"`
- Next, we add a new key-value pair to the dictionary:  
  `dict['University'] = "COMSATS"`
- Finally, we print the dictionary after each change to see the updates

### Note:
- `dict['key'] = value` is used to **update** a key's value if the key exists.
- If the key does **not exist**, this same syntax is used to **add a new key-value pair**.
- Dictionaries are **mutable**, meaning we can modify them after creation.

In [30]:
dict = {'Name':"Aqsa", 'Depart': "BCS", 'Batch': 2014}
print (dict)
dict['Batch'] = "Fall 2021"
print (dict)
dict['University'] = "COMSATS"
print(dict)

{'Name': 'Aqsa', 'Depart': 'BCS', 'Batch': 2014}
{'Name': 'Aqsa', 'Depart': 'BCS', 'Batch': 'Fall 2021'}
{'Name': 'Aqsa', 'Depart': 'BCS', 'Batch': 'Fall 2021', 'University': 'COMSATS'}

## Deleting a Key-Value Pair from a Dictionary using `del`

We are working with the following dictionary:
`dict = {'Name': "Aqsa", 'Depart': "BCS", 'Batch': Fall 2021}`
- First, we print the original dictionary using `print(dict)`
- Then, we delete the `'Batch'` key using:  
  `del dict['Batch']`
- Finally, we print the dictionary again to confirm the deletion

### Note:
- The `del` keyword is used to **remove a specific key (and its value)** from a dictionary.
- If the key doesn‚Äôt exist, it will raise a `KeyError`.
- Dictionaries remain **mutable**, so changes happen directly in memory.

In [33]:
dict = {'Name':"Aqsa", 'Depart': "BCS", 'Batch': "Fall 2021"}
print (dict)
del dict['Batch']
print (dict)

{'Name': 'Aqsa', 'Depart': 'BCS', 'Batch': 'Fall 2021'}
{'Name': 'Aqsa', 'Depart': 'BCS'}

## Clearing All Elements from a Dictionary using `.clear()`

We are working with the following dictionary:
`dict = {'Name': "Aqsa", 'Depart': "BCS", 'Batch': 2021}`
- Using the `.clear()` method to remove **all key-value pairs** from the dictionary:
  `dict.clear()`
- Then printing the dictionary to see that it is now **empty**

### Note:

- `.clear()` is used to **empty** a dictionary but **not delete** it
- After calling `.clear()`, the dictionary still exists, but it contains **no data**
- It‚Äôs useful when you want to reset a dictionary without deleting the variable

In [34]:
dict = {'Name':"Aqsa", 'Depart': "BCS", 'Batch': 2021}
dict.clear()
print (dict)

{}

## Tuple Indexing and Slicing in Python

We are working with the following tuple:
`tup = ('Math', '98', 'C programming', '99')`
- Printing the entire tuple:  
  `print(tup)`
- Accessing the value at index `1`:  
  `print(tup[1])` ‚Üí Should print `'98'`
- Slicing the tuple from index 1 to 2 (3 is excluded):  
  `print(tup[1:3])` ‚Üí Should print `('98', 'C programming')`

### Note:

- Tuples are like lists, but they are **immutable** (can't be changed after creation)
- Indexing in Python starts from **0**
- Slicing works the same way as with lists: `tuple[start:stop]` (stop index not included)

In [35]:
tup = ('Math','98', 'C programming', '99')
print (tup)
print(tup[1])
print(tup[1:3])

('Math', '98', 'C programming', '99')
98
('98', 'C programming')

## Concatenating Tuples (Because Tuples are Immutable)

We are working with two tuples:
`tup1 = (12, 34.56)`  
`tup2 = ('abc', 'xyz')`
- ‚ö†Ô∏è We **cannot update** a value in a tuple like:  
  `tup1[0] = 100` ‚Üí ‚ùå This will cause an error because **tuples are immutable**
- So instead, we **concatenate** two tuples:  
  `tup3 = tup1 + tup2`
- Finally, we print the new tuple:  
  `print(tup3)`
  
### Note:

- Tuples are **immutable**, meaning their elements cannot be changed after creation.
- But you can create **a new tuple** by joining existing ones using the `+` operator.
- This doesn‚Äôt modify the original tuples.

üìå Never try to assign a new value to a specific index in a tuple ‚Äî it will cause a `TypeError`.

In [36]:
tup1 = (12, 34.56);
tup2 = ('abc', 'xyz');
tup3 = tup1 + tup2;
print (tup3);

(12, 34.56, 'abc', 'xyz')

## Deleting a Tuple Using `del`

We are working with the following tuple:
`tup = ('physics', 'chemistry', 1997, 2000)`
- Printing the original tuple:  
  `print(tup)`
- Deleting the entire tuple using:  
  `del tup`
- Trying to print the tuple again after deletion

### Note:

- `del` keyword **completely deletes the variable** from memory.
- After deletion, any reference to that variable will raise a **NameError**
- This is different from `.clear()` (used with dictionaries) ‚Äî because `.clear()` empties the data but keeps the variable.
- In this case, `tup` **no longer exists** after `del tup`.

üìå Rule: If you use `del variable_name`, that variable is fully erased from the program.

In [37]:
tup = ('physics', 'chemistry', 1997, 2000);
print (tup);
del tup;
print ("After deleting tup : ");
print (tup);

('physics', 'chemistry', 1997, 2000)
After deleting tup :

NameError: name 'tup' is not defined

## Python Sets ‚Äì Creation, Modification, and Error Handling

We are performing different operations on Python sets.
1. **Converted a list to a set**  
   - `set(list1)` converts list into a set (removes duplicates)

2. **Created sets**  
   - Set with integers: `{1, 2, 3}`  
   - Set with mixed data types: `{1, "Hello", 1.2, 'C'}`

3. **Added Elements**  
   - `.add('D')` ‚Üí Adds a single value  
   - `.update(list1)` ‚Üí Adds multiple values from a list

4. **Removed Elements**  
   - `.discard('G')` ‚Üí No error if 'G' doesn't exist  
   - `.remove('G')` ‚Üí ‚ùå Raises `KeyError` if 'G' is missing
   - 
### Notes:
- Sets are **unordered** and **do not allow duplicates**
- Use `.add()` for one value, `.update()` for many
- Prefer `.discard()` over `.remove()` to avoid errors
- Sets can hold different data types

üìå Always use `type()` to confirm if your data is a set.

In [41]:
# list
list1 = [1, 2, 3, 4, 5]
print(type(list1))

# convert list to set
my_set = set(list1)
print(my_set)
print(type(my_set))

# set of integers
my_set = {1, 2, 3}
print(my_set)

# set of mixed data types
my_set = {1, "Hello", 1.2, 'C'}

# adding a single value
my_set.add('D')

# adding multiple values
my_set.update(list1)
print(my_set)

# removing values
my_set.discard('G')  # safe, no error
my_set.remove('G')   # will raise KeyError if 'G' not in set

<class 'list'>
{1, 2, 3, 4, 5}
<class 'set'>
{1, 2, 3}
{1, 1.2, 2, 3, 4, 5, 'Hello', 'D', 'C'}

KeyError: 'G'

## Comparison Operation: `1 < 3`

We are performing a basic comparison using the **less than (`<`)** operator.
- Comparing two numbers:
  ```python
  1 < 3
### Note:
- < is a relational operator used to compare two values.
- Returns True if the left side is less than the right side, otherwise False.

üìå 1 < 3 is True because 1 is indeed smaller than 3.

In [43]:
1<3

True

## Comparison Operation: `15 <= 23`

We are performing a basic comparison using the **less than or equal to (`<=`)** operator.
- Comparing two numbers:
  ```python
  15 <= 23
### Note:
- <= returns True if the left side is less than or equal to the right side.
- In this case, 15 is less than 23, so the result is True.

üìå Use <= when you want to allow equality as well as less-than.

In [44]:
15<=23

True

## Comparison Operation: `"Aqsa" == "Airah"`

We are performing a **string comparison** using the **equality (`==`)** operator.
- Comparing two strings:
  ```python
  "Aqsa" == "Airah"
### Note:
- == checks for equality ‚Äî both the value and case must match.
- In this case, 'Aqsa' is not equal to "Airah" ‚Äî so the result is False.

üìå Even though both are strings, the content is different, so the comparison fails.

In [45]:
"Aqsa"=="Airah"

False

## Comparison Operation: `"Aqsa" != "Aqsa"`

We are performing a **string comparison** using the **not equal (`!=`)** operator.
- Comparing two strings:
  ```python
  "Aqsa" != "Aqsa"
  
### Note:
- != returns True only if the two values are different.
- Since both strings are exactly the same ("Mehvish"), the result is False.

üìå Use != to test inequality between two values.

In [46]:
"Aqsa"!="Aqsa"

False

## Logical Operation: `(1 == 1) or (5 > 2)`

We are performing a logical operation using the **`or`** operator.
- Evaluating two conditions:
  ```python
  (1 == 1)     # True
  (5 > 2)      # True
- or returns True if at least one of the conditions is True.
- In this case, both are True, so the final result is also True.

In [47]:
(1==1)or(5>2)

True

## Logical Operation: `(1 < 2) and (2 < 1)`

We are performing a logical operation using the **`and`** operator.
- Evaluating two conditions:
  ```python
  (1 < 2)     # True
  (2 < 1)     # False
### Note:
- and returns True only if both conditions are True.
In this case:
- First condition is True
- Second condition is False
Since one is false, the result is False.

üìå Use and when both conditions must be true for the overall result to be true

In [48]:
(1<2)and(2<1)

False

## Using `if-else` to Check Even or Odd Number

We are checking whether the number `25` is even or odd using the modulo (`%`) operator
    
- % is the modulo operator, which returns the remainder after division.
- 25 % 2 returns 1, which means 25 is not divisible by 2 ‚Äî so it is odd.
- Since 25 % 2 == 0 is False, the else block runs.
    
### Note:
- % is the modulo operator ‚Äî it gives the remainder after division.
- Any number % 2 gives:
  
`0 ‚Üí Even number
1 ‚Üí Odd number`

Always use == 0 in the condition when checking for even numbers.

üìå Indentation is very important in Python. Always use 4 spaces or a tab inside if, else, while, etc.

In [50]:
if 25 % 2 == 0:
    print('Even')
else:
    print('Odd')

Odd

## Example of `for` Loop: Calculating Factorial

We are using a `for` loop to calculate the factorial of a number (5 in this case).

- range(1, N+1) gives numbers from `1 to 5`
- fact *= i is shorthand for fact = `fact * i`
- The loop multiplies fact by each i from `1 to 5`
- Final value: `1√ó2√ó3√ó4√ó5 = 120`

üìå Make sure the loop body is properly indented, otherwise Python throws an IndentationError

In [51]:
fact = 1
N = 5
for i in range(1, N + 1):
    fact *= i
print(fact)

120

## Example of `while` Loop: Counting from 1 to 10

We are using a `while` loop to print numbers from 1 to 10.

- a = 0 initializes the variable
- while a < 10 continues the loop until a reaches 10
- a = a + 1 increments a by 1 on each iteration
- print(a) prints the current value of a
- Loop stops when a becomes 10

üìå Always indent the block inside while or for loops to avoid errors.

In [1]:
a = 0
while a < 10:
    a = a + 1
    print(a)

1
2
3
4
5
6
7
8
9
10

## Example: User-Defined Function in Python

We are defining a simple function that takes a string argument and prints it.
- We define a function using the `def` keyword and name it `printme`.
- This function takes one input parameter called `str` (which holds a string).
- The code written inside the function runs only when we **call** the function.
- When we call the function:
  - It prints the string passed to it.
  - Then it reaches the `return` statement ‚Äî which is optional in this case because nothing is being returned.
- After the function is defined, it is **called** with a string:  
  `"I'm first call to user defined function!"`

### Note:

- Functions help us **reuse code** and keep it organized.
- The code inside the function must be **indented** properly.
- The `str` in the parameter is just a variable name ‚Äî it can be changed.
- The `return` keyword is used to exit the function or return a value (optional in this case).

üìå Functions are useful when the same action needs to be performed multiple times in a program.

In [2]:
def printme(str):
    print(str)
    return
printme("I'm first call to user defined function!")

I'm first call to user defined function!

## Example: Function That Returns a Value

We are defining a function that takes a number as input and returns its square.

- We define a function named `f` using the `def` keyword.
- It takes one parameter: `x`.
- Inside the function, we calculate `x ** 2` ‚Äî which means "x raised to the power 2" or simply "x squared".
- The function uses `return` to **send the result back** to wherever it was called.
- We call the function with the value `8` using `f(8)`.
- The result is then printed outside the function using `print()`
- `x ** 2` means `x √ó x`
- So, when `x = 8`, the result is `8 √ó 8 = 64`
- Because the function **returns** a value, it can be used in expressions or printed
- `return` is important when you want to use the result later (instead of just printing inside the function)

### Note:  
Use `return` in a function when you want to send a value back for further use.

In [4]:
def f(x):
    return x**2

print(f(8))

64

## Lambda Function in Python

We are learning about **lambda expressions**, which are small anonymous functions written in a single line.

- We create a lambda function named `times3` that takes one input (`var`) and returns `var * 3`
- This is a shorter way of writing simple functions without using the full `def` keyword
- The function is called using `times3(10)`
- It multiplies 10 by 3 and gives the result
- A **lambda function** is used for small operations, especially when we don‚Äôt want to write a full function
- Syntax: `lambda arguments: expression`
- In this case:
  - `lambda var: var * 3` ‚Üí means take input `var`, multiply it by 3, and return the result
- We assigned this lambda function to the name `times3`, so we can call it like a normal function
  
### Note:
Use lambda functions for **simple, one-line** operations, often useful in filtering, mapping, or sorting tasks.

In [5]:
times3 = lambda var:var*3
times3(10)

30

## Using `lambda` with `map()` to Count Word Lengths

We are working with a sentence and calculating the length of each word using a `lambda` function along with `map()`.

- A sentence is given: `"It is raining cats and dogs"`
- The `split()` function is used to break the sentence into a list of words
- The result is: `['It', 'is', 'raining', 'cats', 'and', 'dogs']`
- We use the `map()` function along with a `lambda` expression to calculate the length of each word
- `lambda word: len(word)` ‚Üí This anonymous function returns the length of each word
- `map()` applies this lambda to every word in the list
- Finally, `list(lengths)` is used to convert the mapped result into a list
- `'It'` ‚Üí 2 characters  
- `'is'` ‚Üí 2 characters  
- `'raining'` ‚Üí 7 characters  
- `'cats'` ‚Üí 4 characters  
- `'and'` ‚Üí 3 characters  
- `'dogs'` ‚Üí 4 characte
### Note:
- `map()` is used to apply a function to each item in a sequence  
- `lambda` lets us define the function quickly without using `def`  
- The result from `map()` must be converted to a list to view the output

In [6]:
sentence = 'It is raining cats and dogs'
words = sentence.split()
print (words)
lengths = map(lambda word: len(word), words)
list(lengths)

['It', 'is', 'raining', 'cats', 'and', 'dogs']

[2, 2, 7, 4, 3, 4]

## Using `lambda` with `filter()` to Extract Odd Numbers

We are using the `filter()` function along with a `lambda` expression to filter out only the **odd numbers** from a list of Fibonacci numbers.

- We are given a list of Fibonacci numbers:  
  `[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55]`
- We use the `filter()` function to **select only the numbers that are odd**
- A `lambda` expression is used:  
  `lambda x: x % 2`  
  This checks if a number has a remainder when divided by 2 ‚Üí which means it is odd
- `filter()` applies this check to each element in the list
- The result is an iterator, so we convert it to a list to view the filtered values
- `% 2` gives remainder after dividing by 2  
- If the remainder is `1`, the number is odd  
- So this filter keeps only the numbers where `x % 2 == 1`
- Even numbers like `0`, `2`, `8`, `34` are skipped

### Note: 
- `filter()` is used to extract items that match a condition  
- `lambda` provides a quick way to write the condition inline  
- Always convert the `filter()` result to a list if you want to print or store it

In [8]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result1 = filter(lambda x: x % 2, fib)
list(result1)

[1, 1, 3, 5, 13, 21, 55]

## Using `lambda` with `filter()` to Extract Even Numbers

We are using a `lambda` function with the `filter()` method to filter out only the **even numbers** from a list of Fibonacci numbers.

- A list of Fibonacci numbers is given:  
  `[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55]`
- We want to extract only the **even numbers** from this list
- A `lambda` function is used:  
  `lambda x: x % 2 == 0`  
  This checks if a number is divisible by 2 with no remainder
- `filter()` applies this condition to every item in the list
- The result is an iterator, so we convert it to a list to view the filtered values
- `% 2 == 0` means the number is divisible by 2 (i.e., even)
- So, numbers like `0`, `2`, `8`, and `34` are selected
- Odd numbers like `1`, `3`, `5`, etc., are ignored

### Note:*
- `filter()` is used to extract elements that **match a condition**
- `lambda` provides a quick, inline way to write that condition
- Always use `list()` to view the result from `filter()` as it returns a filter object (iterator)

In [9]:
fib = [0,1,1,2,3,5,8,13,21,34,55]
result2 = filter(lambda x: x % 2 == 0, fib)
list (result2)

[0, 2, 8, 34]

## Taking User Input in Python

We are using the `input()` function to get input from the user and then display it on the screen.

- The program prompts the user with the message: `"Enter your name:"`
- Whatever the user types in response is stored in a variable called `string`
- Then `print()` is used to display the entered name
- `input()` is a built-in Python function that pauses the program and waits for the user to type something
- The text entered is always stored as a **string**
- In some environments (like Python 2), `six.moves.input` is used to make input work the same as in Python 3
- `print()` simply displays the stored input

### Note: 
Make sure you are running this in a console or terminal that supports user interaction ‚Äî in some notebook environments, `input()` may not behave as expected.

In [12]:
from six.moves import input
string = input("Enter your name: ");
print(string)

Enter your name:  Aqsa

Aqsa

## Full File Handling Example in Python: Writing and Reading a File

In this example, we are creating a file, writing content to it, then reading that content back and printing it.

1. **Creating and Writing to the File:**
   - We open `"file.txt"` in `"w"` mode.
   - This mode creates the file if it doesn‚Äôt exist or overwrites it if it does.
   - We write two lines of text into the file using `write()`:
     - `This is a test file.`
     - `Welcome to Python file handling!`
   - We then close the file using `close()`.

2. **Reading from the File:**
   - We reopen the file in `"r+"` mode which allows both reading and writing.
   - We read the content of the file using `read()`.
   - The content is stored in a variable and printed.
   - We then close the file again using `close()`.

- `"w"` mode is used when we want to write new content into a file (and overwrite if already present).
- `"r+"` mode is used to both read and write, but the file **must already exist**.
- `read()` fetches all text from the file as a single string.
- `close()` is used to safely release the file resource after reading or writing.

### Note:
Always use `close()` after opening a file to avoid memory or file lock issues. You can also use `with open(...)` to handle files automatically.

In [18]:
fileOpen = open("file.txt", "w") 
fileOpen.write("This is a test file.\nWelcome to Python file handling!")
fileOpen.close()

fileOpen = open("file.txt", "r+")
str = fileOpen.read()
print(str)
fileOpen.close()

This is a test file.
Welcome to Python file handling!

## Appending and Reading a File in Python

In this example, we are learning how to **append new data** to an existing file and then **read** the updated content

1. **Opening File in Append Mode (`a+`):**
   - `a+` mode is used to **append** new data to the end of the file.
   - If the file does not exist, it will be created.
   - We add the text: `" Information Technology Lahore"` at the end of the existing file content.
   - We then close the file to save the changes.

2. **Reopening File in Read Mode (`r+`):**
   - `r+` mode is used to **read and write** from the beginning of the file.
   - We read the full content using `read()`.
   - The content is stored in a variable and printed.
   - The file is closed again at the end.

- `a+` ‚Üí Appends new data without deleting existing content. The file pointer is at the end.
- `r+` ‚Üí Allows reading and writing from the beginning of the file (but doesn't erase content).
- `read()` reads all content starting from the top of the file.
- Always use `close()` after file operations to save changes and free up memory.

üìå **Tip:**  
You can use `read(12)` instead of `read()` to read only the **first 12 characters** of the file.

In [20]:
fileOpen = open("file.txt", "a+")
fileOpen.write(" Information Technology Lahore")
fileOpen.close()

fileOpen = open("file.txt", "r+")
string = fileOpen.read()  
print(string)

fileOpen.close()

This is a test file.
Welcome to Python file handling! Information Technology Lahore

## File Pointer Control in Python: Using `tell()` and `seek()`

In this example, we are learning how to check and reset the position of the file pointer while reading a file.

1. **Opening the File:**
   - The file `"file.txt"` is opened in `"r+"` mode, which allows both reading and writing.
   - We read the first 10 characters using `read(10)` and store them in a variable.

2. **Checking File Pointer Position:**
   - We use `tell()` to find the current position of the file pointer.
   - This tells us how many bytes (or characters) have been read so far.

3. **Resetting the File Pointer:**
   - We use `seek(0, 0)` to move the pointer back to the **start** of the file.
   - The first `0` is the offset, and the second `0` tells it to move from the beginning.

4. **Reading Again:**
   - We again read the first 10 characters to confirm that the file pointer was reset.

5. **Closing the File:**
   - We use `close()` to close the file after reading is done.

- `read(10)` ‚Üí Reads first 10 characters
- `tell()` ‚Üí Shows current pointer position (after reading)
- `seek(0, 0)` ‚Üí Resets pointer to beginning of file
- After resetting, we can read the same content again

üìå **Tip:**  
Use `tell()` and `seek()` when you want to **navigate through large files**, or **re-read specific sections** without reopening the file.

In [21]:
fo = open("file.txt", "r+")
str = fo.read(10);
print("ReadStringis:\n",str)

position = fo.tell();
print("Currentfileposition:\n", position)

position = fo.seek(0, 0);
str = fo.read(10);
print("AgainreadStringis:\n", str)

fo.close()

ReadStringis:
 This is a
Currentfileposition:
 10
AgainreadStringis:
 This is a

## Renaming a File in Python using `os.rename()`

In this example, we are renaming an existing file using Python's built-in `os` module.

1. **Importing the `os` Module:**
   - The `os` module provides functions to interact with the operating system.
   - We use it to rename, delete, or check files and directories.

2. **Renaming the File:**
   - The `rename()` function takes two arguments:
     - The current file name: `"file.txt"`
     - The new name we want to give: `"newfile.txt"`
   - If the file `"file.txt"` exists in the current working directory, it gets renamed to `"newfile.txt"`

In [ ]:
import os
os.rename("file.txt","newfile.txt")

In [31]:
import os
print(os.listdir())

['.ipynb_checkpoints', 'Aqsa_Assignment_01_Python_Tutorial.ipynb.ipynb', 'newfile.txt', 'trail base.ipynb']

## Removing a File in Python using `os.remove()`

In this example, we are deleting a file from our system using Python's built-in `os` module.

1. **Importing the `os` Module:**
   - Python‚Äôs `os` module provides functions to interact with the file system.

2. **Deleting the File:**
   - We use `os.remove("newfile.txt")` to delete a file named `"newfile.txt"` from the current directory.

In [32]:
os.remove("newfile.txt")

In [33]:
import os
print(os.listdir())

['.ipynb_checkpoints', 'Aqsa_Assignment_01_Python_Tutorial.ipynb.ipynb', 'trail base.ipynb']

## Creating a Pandas Series with Random Data

In this example, we are creating a **Pandas Series** using random values and custom indexes.

1. **Importing Libraries:**
   - `pandas as pd`: For handling data structures like Series and DataFrames.
   - `numpy as np`: For generating random numbers.
   - `matplotlib.pyplot`: (Though not used here yet) is generally used for plotting.

2. **Creating a Series:**
   - We use `pd.Series()` to create a one-dimensional labeled array.
   - The data inside the Series is generated using `np.random.randn(5)`, which creates 5 random numbers from a **standard normal distribution** (mean = 0, std = 1).


### Note:
The actual values will change every time because they're randomly generated.

### Key Concepts:

- **Pandas Series** is like a column in Excel: it has both **values** and **labels (indexes)**.
- `np.random.randn()` is useful when simulating or testing data.
- Indexes allow you to access data like: `s['a']` or `s['c']`.

üìå Pandas Series is a foundational part of working with DataFrames and real-world data analysis.

In [34]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
print(s)

a   -0.929916
b    1.485594
c   -0.488592
d    0.769381
e    0.690711
dtype: float64

## Accessing Index of a Pandas Series

- `s.index` returns the **index labels** of the Pandas Series `s`.
- Indexes are like "labels" for each value in the Series (e.g., 'a', 'b', 'c', etc.).
- It also shows the **data type** of the index values ‚Äî in this case: `dtype='object'`, meaning they're strings.

### Note:

- Indexes can be numbers, strings, dates, or any hashable type.
- You can access individual elements using their index like s['a'].

In [35]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

## Creating a Pandas Series Without Custom Index

- When we use `pd.Series(np.random.randn(5))` **without providing custom index labels**, 
  Pandas automatically assigns **default integer indexes**.
- These indexes start from `0` and go up to `n-1` (in this case, 4).

### Note:
- **Index values** are important in Pandas as they help you **label, access, and manipulate** data.
- You can still access values by position using `s_default[0]`, `s_default[1]`, etc.

In [36]:
pd.Series(np.random.randn(5))

0    0.705552
1    1.295424
2    1.578525
3    1.571161
4    0.491149
dtype: float64

## Creating a Pandas Series from a Python Dictionary

- We are using a **Python dictionary** to create a Pandas Series.
- The dictionary contains keys `'a'`, `'b'`, `'c'` with corresponding float values `0.0`, `1.0`, and `2.0`.
- When we pass the dictionary to `pd.Series()`:
  - The **keys** become the **index labels** of the Series.
  - The **values** become the **data** in the Series.
- If no specific index is given, Pandas automatically uses the keys in their **original order** (Python 3.7+ preserves insertion order).

In [37]:
d = {'a' : 0., 'b' : 1., 'c' : 2.} 
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

## Custom Indexing When Creating a Series from a Dictionary

- We are creating a Pandas Series from a Python dictionary.
- While doing so, we explicitly provide a **custom list of indexes**: `['b', 'c', 'd', 'a']`
- The dictionary `d = {'a': 0.0, 'b': 1.0, 'c': 2.0}` has 3 keys: `'a'`, `'b'`, and `'c'`.
- When we pass a custom index to `pd.Series()`, Pandas **pulls values** from the dictionary **that match the provided index labels**.
- If a label in the index (like `'d'`) does **not exist** in the dictionary, Pandas assigns **NaN** (Not a Number) to it.
- 
### Note:
- `NaN` indicates missing data ‚Äî useful for identifying gaps in data when merging or importing.
- The order of the index in the resulting Series follows exactly what we specify, not the original dictionary order.

üìå This is useful when you want to **reorder**, **subset**, or **align data** using a predefined index structure.

In [38]:
pd.Series(d, index=['b', 'c', 'd', 'a'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

## Creating a Pandas Series with a Scalar Value

 We are creating a Pandas Series using a **single scalar value** (in this case: `5.0`) and a custom list of index labels: `['a', 'b', 'c', 'd', 'e']`.

- Since only **one scalar value** is provided and the index has **multiple labels**, Pandas automatically **broadcasts (repeats)** the scalar value for each index.
- Every index in the list receives the **same value**.

### Note:

- This is a quick way to create a uniform Series where every value is the same.
- Useful in scenarios like initializing default scores, marks, or constant settings across labeled entries.

üìå **Tip:** You can later update specific values in the Series by using their index label, e.g. `s['b'] = 10`

In [39]:
pd.Series(5., index=['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

## Accessing Values in a Pandas Series

- We are accessing a **single value** from a Pandas Series using its **positional index** ‚Äî just like we do in NumPy arrays.
- `s[0]` returns the **first value** in the Series.
(This assumes the Series `s` was created using a scalar value `5.0` for all indexes.)

### Note:

- **`s[0]`** accesses the **first element by position** (not by label).
- You can also use the **label** like `s['a']` to access the same element.
- This makes Pandas Series powerful ‚Äî it supports both **label-based** and **position-based** access.

üìå Useful when working with numerical data or quickly referencing elements by index.

## FutureWarning in Pandas: Series Indexing with `s[0]`
- Warning Message Means:
- Currently, when you write `s[0]`, Pandas **treats 0 as a position** (first element).
- But in the **future**, `s[0]` will mean: "give me the value at index label `0`", **not** the first position.

### Solution:

| Operation             | Use This Now         | Why                            |
|----------------------|----------------------|---------------------------------|
| Access by position   | `s.iloc[0]`          | Safe and correct way to get first value |
| Access by label `'a'`| `s.loc['a']`         | Recommended for label-based access  |


### Correct usage

s.iloc[0]     # Returns: 10 (by position)

s.loc['a']    # Returns: 10 (by label)

In [40]:
s[0]

C:\Users\hp\AppData\Local\Temp\ipykernel_2040\243613605.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[0]

np.float64(-0.9299157747152657)

## Slicing a Pandas Series using `s[:5]`

We are slicing the Series `s` to access the **first 5 elements** using the syntax `s[:5]`.

- This is **position-based slicing**.
- The slice `[:5]` means: start from index **position 0** up to (but not including) position **5**.
- It behaves just like Python lists or NumPy arrays.

### Note:

- Slicing always returns a **new Series** with the selected portion.
- This is **not label-based**, it is **position-based** slicing.
- No warning appears because slicing is safely interpreted by position.

üìå Use `.iloc[:5]` if you want to be explicit and warning-free for position-based slicing.

In [41]:
s[:5]

a   -0.929916
b    1.485594
c   -0.488592
d    0.769381
e    0.690711
dtype: float64

## Filtering a Series Using Median with Boolean Indexing

We are using **Boolean indexing** to select only those elements in the Series `s` that are **greater than the median** of the Series.

- `s.median()` calculates the **median** value of the Series `s`.
- `s > s.median()` creates a **Boolean Series** where each value is either `True` or `False` depending on the condition.
- `s[condition]` filters and returns only the values where the condition is `True`.

### Note:

- Helps in data filtering and analysis.
- Very powerful when combined with functions like `.mean()`, `.min()`, `.max()`, etc.
- Clean and efficient way to **select specific data points** based on a condition.

In [42]:
s[s > s.median()]

b    1.485594
d    0.769381
dtype: float64

## Fancy Indexing in Pandas Series Using a List of Positions

We are accessing multiple **specific elements** from the Series `s` using a list of **positions**.
- Syntax: `s[[4, 3, 1]]`
- This is called **fancy indexing**.
- The list `[4, 3, 1]` contains the **positions** of the elements we want to extract from the Series.
- Pandas will return a **new Series** containing only these elements in the **specified order**.

### Note:

- This is position-based, not label-based access.
- The order of output matches the order of positions in the list.
- Useful when you need to extract non-continuous values or rearrange Series elements.

In [44]:
s.iloc[[4, 3, 1]]

e    0.690711
d    0.769381
b    1.485594
dtype: float64

## Applying NumPy's `exp()` Function to a Pandas Series

- We are applying the `np.exp()` function (from NumPy) to a Pandas Series `s`.
- `np.exp(x)` computes the **exponential value** of each element:  
  \[ \exp(x) = e^x \]  
  where `e ‚âà 2.718`
- Since Pandas Series is **NumPy-compatible**, the `np.exp()` function applies **element-wise**.
- It returns a **new Series** where each element is replaced by its exponential value.

### Note:

- NumPy functions like `np.exp`, `np.sqrt`, `np.log`, etc., work **seamlessly** with Pandas.
- This makes Pandas very useful for **vectorized mathematical operations**.

üìå You can chain or combine this with filters, e.g.:
```python
np.exp(s[s > 0])

In [45]:
np.exp(s)

a    0.394587
b    4.417587
c    0.613489
d    2.158430
e    1.995135
dtype: float64

## Accessing a Value in Pandas Series Using a Label: `s['a']`

- We are retrieving a value from the Series `s` using a **label** ‚Äî in this case, `'a'`.
- This is called **label-based access**, similar to accessing a dictionary value by key.
- Each Series has an **index (label)** attached to its values.
- Writing `s['a']` returns the value **associated with label `'a'`**.

### Note:

- This is not position-based (not the same as s[0]).
- Label-based access is safe, clear, and recommended.
- No warning is shown (unlike ambiguous integer access).

üìå If label 'a' does not exist, Pandas will raise a KeyError.

In [46]:
s['a']

np.float64(-0.9299157747152657)

## Updating a Value in Pandas Series Using a Label: `s['e'] = 12.`

We are updating the **value at index label `'e'`** in the Series `s` and assigning it a new value: `12.0`.

- `s['e'] = 12.` directly **modifies** the value at label `'e'`.
- This works similar to updating a dictionary in Python.
- The Series remains the same object ‚Äî only the value is updated.

### Note:

- This is label-based assignment ‚Äî very intuitive and powerful.
- You can also use this method to:
 - Update multiple values using a loop or condition.
 - Add a new label (if it doesn‚Äôt already exist).
- It‚Äôs a fast and clean way to modify data in-place.

üìå Use .loc['e'] = 12. for the same effect ‚Äî .loc is the preferred and explicit method for label-based assignment.

In [47]:
s['e'] = 12.
s

a    -0.929916
b     1.485594
c    -0.488592
d     0.769381
e    12.000000
dtype: float64

## Checking If a Label Exists in a Pandas Series: `'e' in s`

- We are checking whether the label `'e'` exists in the **index** of the Series `s`.
- This returns a **Boolean value**: `True` or `False`.
- In Pandas, `s` (a Series) behaves like a dictionary.
- So `'e' in s` checks if `'e'` is one of the **keys (index labels)** in the Series.
- If it is, it returns `True`; otherwise, it returns `False`.

### Note:

- This only checks the index (labels), not the values.
- Useful in conditional statements or before accessing a label to avoid KeyError.

In [48]:
'e' in s

True

In [49]:
'z' in s

False

## Accessing a Non-Existent Label in Pandas Series: `s['f']`

We are trying to access the value at label `'f'` in the Series `s` using `s['f']`.

- If `'f'` **does not exist** in the index of Series `s`, Pandas raises a `KeyError`.
 
### Error Trace:
```python
KeyError: 'f'

-This error means that the label 'f' is not found in the index of the Series.
- Pandas Series works like a dictionary.
- If you try to access a key (index label) that isn‚Äôt defined, you get a KeyError.

In [50]:
s['f']

KeyError: 'f'

## Safe Access in Pandas Series Using `.get()`

We are using `s.get()` to **safely access** the value of a label in a Pandas Series.

### Use `.get()`:

- Unlike s['f'], which raises a KeyError if 'f' is not found,
- .get('f') quietly returns None or any custom default value you provide.
- 
### Examples:

```python
s.get('f')          # ‚ûù Returns None if 'f' is not in the index
s.get('f', np.nan)  # ‚ûù Returns np.nan (default value) if 'f' is missing

In [51]:
s.get('f') 
s.get('f', np.nan)

nan

## Element-wise Addition of a Pandas Series with Itself: `s + s`

In this example we are adding the Series `s` to itself: s + s

- Each element in the Series is added to its corresponding element with the same label:
- `a = s['a'] + s['a']`
- `b = s['b'] + s['b']`

- Suppose the original Series is:
`s =` 
`a    2.0`  `b    3.0` 

- then: `a     4.0  # 2.0 + 2.0` `b     6.0  # 3.0 + 3.0`

### Note:

- Operation is done label-wise, not position-wise.
- Fast and efficient ‚Äî takes advantage of Pandas‚Äô vectorized operations.
- If a label is missing in either Series, the result will be NaN for that label.

In [53]:
a = s['a'] +s['a'] 
b = s['b'] +s['b'] 
c = s['c'] +s['c']
d = s['d'] +s['d']
e = s['e'] +s['e']
s + s

a    -1.859832
b     2.971187
c    -0.977185
d     1.538762
e    24.000000
dtype: float64

## Multiplying a Pandas Series by a Scalar (`s * 2`)

In this example we are multiplying each element in the Series `s` by **2** using:s * 2

- Each value in the Series is multiplied by 2:
`a = s['a'] * 2` `b = s['b'] * 2`

### Note:

- This is a scalar operation in Pandas ‚Äî applies to all values.
- It's part of Pandas' vectorized computation, so it runs efficiently.

In [54]:
a = s['a'] *2
b = s['b'] *2
c = s['c'] *2
d = s['d'] *2
e = s['e'] *2
s * 2

a    -1.859832
b     2.971187
c    -0.977185
d     1.538762
e    24.000000
dtype: float64

## Naming a Pandas Series

We are creating a Pandas Series using `pd.Series()` and giving it a custom name using the `name` parameter.

- np.random.randn(5) generates `5` random numbers.
- `name='Aqsa'` assigns a label/name to the entire Series.
- When printed, the `name appears at the bottom` of the Series output.

### Note:
- Helps in data labeling and readability.
- When used in a DataFrame or plotting, this name helps identify the Series.
- Useful during merging, plotting, or exporting.

In [56]:
s = pd.Series(np.random.randn(5), name='Aqsa')
s

0    0.527903
1   -1.202904
2   -0.591156
3    0.160297
4    0.205735
Name: Aqsa, dtype: float64

## Accessing the Name of a Pandas Series

We are retrieving the **name** assigned to the Series `s` using: `s.name`

- This line returns the string name that was assigned to the Series when it was created.
- Helps track or dynamically check the Series label.
- Handy when working with multiple named Series in DataFrames.

In [57]:
s.name

'Aqsa'

## Renaming a Pandas Series

We are renaming the Series `s` to a **new name** `"different"` using:s2 = s.rename("Aqsa Malik)

- rename("Aqsa Malik") creates a new Series with the same values as s but with a different name.
- The original Series s remains unchanged.
- s2.name will now return 'Aqsa Malik'.

### Note:
- rename() does not modify the original Series.
- This is helpful when you want to assign a temporary or more descriptive name during data processing or plotting.

In [58]:
s2 = s.rename("Aqsa Malik")
s2.name

'Aqsa Malik'

## Creating a DataFrame from a Dictionary of Series

We are creating a **DataFrame** from a dictionary `d` that contains two Pandas Series:

- Each key in the dictionary `('one', 'two')` becomes a column label in the DataFrame.
- The index for the DataFrame is automatically taken from the union of all Series indices.
- If a Series does not have a value for a specific index, it is filled with `NaN`.

### Note:

- Index d does not exist in Series 'one', so it appears as NaN in that column.
- This is a very common and powerful way to build DataFrames from raw data in Python.

In [59]:
d = {
'one' : pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
'two' : pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])
}
df=pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

## Creating a DataFrame with Custom Row Order

We are passing a dictionary of Series to `pd.DataFrame()` and also providing a **custom row index**: 
`pd.DataFrame(d, index=['d', 'b', 'a'])`

- d is a dictionary where keys are column labels `('one' and 'two')`.
- The index parameter defines the row labels and their order.
- Pandas will reorder the rows based on the given index.
- If any value is missing for the specified index, it will show as NaN.

#### Note:
- The row order is now d, b, a instead of the default `a, b, c, d`.
- Row 'd' has no value in column 'one', so it appears as `NaN`.

In [60]:
pd.DataFrame(d, index=['d', 'b', 'a'])

   one  two
d  NaN  4.0
b  2.0  2.0
a  1.0  1.0

## Creating a DataFrame with Custom Rows and Columns

We are building a DataFrame using: `pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])`

- d is a dictionary of Series, like:
**{
    'one': pd.Series(...),
    'two': pd.Series(...)
}**

- We are customizing:
 `Rows with index=['d', 'b', 'a']` 
 `Columns with columns=['two', 'three']`

- Column 'two' exists in the dictionary d, so values are fetched from the corresponding Series.
- Column 'three' does not exist, so all values in that column become `NaN`.
- Row labels are set to `'d', 'b', and 'a'` ‚Äî in that order.

### Note:
- You can use this approach to:
- Reorder or select specific rows
- Add empty columns for future use or processing

In [61]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

## Accessing DataFrame Column Labels

We are retrieving the **column names** of the DataFrame `df` using: `df.columns`

- This line returns an Index object containing all column names of the DataFrame.
- Helps when you want to:
- Check or confirm column labels,Rename columns, Loop through column names

In [62]:
 df.columns

Index(['one', 'two'], dtype='object')

## Creating a DataFrame from a Dictionary of Lists

We are creating a DataFrame using a dictionary `d` where:
**d = {
    'one' : [1., 2., 3., 4.],
    'two' : [4., 3., 2., 1.]
}**

- Each key in the dictionary becomes a column label `('one', 'two')`.
- The values are lists, which become the data for each column.
- Since we did not provide any row index, Pandas auto-generates default row numbers as `0, 1, 2, 3`.

### Note:
- Column names: Taken from dictionary keys.
- Row index: Auto-generated as integers.
- Each list in the dictionary must have the same length, otherwise Pandas will raise an error.

In [63]:
d = {
'one' : [1., 2., 3., 4.],
'two' : [4., 3., 2., 1.]
}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

## Creating a DataFrame with Custom Row Index

We are using a dictionary of lists `d` and creating a DataFrame with a **custom row index**:
**d = {
    'one': [1., 2., 3., 4.],
    'two': [4., 3., 2., 1.]
}
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])**

- The keys `'one' and 'two'` become the column labels.
- The lists become column data.
- The index=['a', 'b', 'c', 'd'] defines custom row labels instead of default `0, 1, 2, 3`.

### Note:
- Useful for giving meaningful row labels (like names, dates, etc.).
- The number of index labels must match the number of rows (4 in this case).

In [64]:
pd.DataFrame(d, index=['a', 'b', 'c', 'd'])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

## Creating a DataFrame from a List of Dictionaries

We are passing a list of dictionaries to `pd.DataFrame()`:

- Each dictionary represents a row in the DataFrame.
- Keys in the dictionaries become column names.
- If a key is missing in a particular dictionary, Pandas fills that cell with NaN (Not a Number).
  
### Use:
- Great for creating tables from JSON-like data or API responses.
- Handles missing data flexibly.
- Automatically aligns dictionary keys with columns.

### Note:
- Missing values (c is missing in the first dict) are automatically replaced with NaN.
- You can specify column order with the columns parameter if needed.

In [65]:
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

## DataFrame from a List of Dictionaries with Custom Row Labels

`Row label a	b	c`
 `first	1.0	2.0	NaN`
 `second	5.0	10.0  20.0`

- Keys in each dictionary become column names ('a', 'b', 'c').
- The list position determines the row, but we override it with the custom labels first and second.
- Any missing key (e.g., 'c' in the first dictionary) is filled with NaN.

In [66]:
pd.DataFrame(data2, index=['first', 'second'])

        a   b     c
first   1   2   NaN
second  5  10  20.0

## Creating a DataFrame from List of Dictionaries with Selected Columns

- We are telling Pandas to only include columns **'a' and 'b'**.
- Although the second dictionary also contains **'c'**, it is excluded from the DataFrame because it is not listed in columns.

### Note:
- Columns not listed ('c' in this case) are ignored, `even if present in data`.
- If you list a column that doesn‚Äôt exist in any dictionary, `Pandas will fill it with NaN`.

In [5]:
pd.DataFrame(data2, columns=['a', 'b'])

   a   b
0  1   2
1  5  10

## Creating a MultiIndex DataFrame (Rows & Columns with Tuples)

- The outer dictionary defines the data.
- The keys `(like ('a', 'b'), ('a', 'a'), etc.)` become the column MultiIndex ¬†‚Üí‚ÄØPandas turns them into a two‚Äëlevel column index.
- The nested keys `(like ('A', 'B'), ('A', 'C'), etc.)` become the row MultiIndex...
- MultiIndex Columns: You're using tuples like ('a', 'b'), so columns are grouped and nested.
- MultiIndex Rows: Same idea applies ‚Äî rows like ('A', 'B') form hierarchical indexing.
- Missing values (if any key isn't present) are filled with NaN automatically.

### Note:
- Great for complex pivot tables, hierarchical data, or multi-dimensional categorization.
- Useful in finance, reporting, or any nested grouping.

In [6]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

## Creating a Structured NumPy Array with Named Columns (Fields)

- We are creating a structured NumPy array using `np.zeros`.
- It has 2 rows, and each row is a record with named fields:
   - 'A': integer of 4 bytes `('i4')`
   - 'B': float of 4 bytes `('f4')`
   - 'C': string of 10 characters `('a10')`
- Default values are all zeros (0 for numbers, empty b'' for bytes/strings).
- You can now access data using the field names, like **data['A'], data['B']**, etc.

### Note:
- Useful for tabular-like data in NumPy where each column has a different datatype.
- Acts like a lightweight DataFrame with fixed-size fields and no overhead.

In [10]:
data = np.zeros((2,), dtype=[('A', 'i4'), ('B', 'f4'), ('C', 'S10')])
data

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

## Creating a DataFrame from a Structured NumPy Array Using `.from_records()`

- np.zeros(...) creates a structured array with named fields: `A, B, and C.`
- pd.DataFrame.from_records(data) converts this NumPy array into a DataFrame.
- index='C' sets column C as the row index of the DataFrame.

### Notes:
- The 'C' field contains byte strings `('S10')` by default ‚Äî that‚Äôs why the index appears as b''.

In [11]:
pd.DataFrame.from_records(data, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

## Deprecation Alert: `pd.DataFrame.from_items()` is Removed in Latest Pandas

### Error:
- AttributeError: type object **'DataFrame'** has no attribute `'from_items`
- from_items() was deprecated in Pandas `1.1.0` and removed in newer versions.
- It was previously used to create a DataFrame from an ordered list of key-value pairs (like OrderedDict).

### Recommended Alternative:
- Use a dictionary directly to achieve the same result:
  
import pandas as pd
df = pd.DataFrame({'A': [1, 2, 3],'B': [4, 5, 6]})

In [16]:
pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])])

AttributeError: type object 'DataFrame' has no attribute 'from_items'

In [19]:
import pandas as pd
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6]
})
df

   A  B
0  1  4
1  2  5
2  3  6

### Error: `DataFrame.from_items()` is Removed in Newer Versions of Pandas

- AttributeError: type object `'DataFrame'` has no attribute `'from_items'`
- from_items() was deprecated in Pandas `v0.21.0` and removed in `v1.1.0`.
- It was used to create a DataFrame from key-value pairs (typically in ordered form).

### Correct Modern Approach:
- You can use a simple dictionary with `orient='index' and columns=...` like this:

import pandas as pd
data = {'A': [1, 2, 3],'B': [4, 5, 6]}
df = pd.DataFrame.from_dict(data, orient='index', columns=['one', 'two', 'three'])
df

In [20]:
pd.DataFrame.from_items([('A', [1, 2, 3]), ('B', [4, 5, 6])],
orient='index', columns=['one', 'two', 'three'])

AttributeError: type object 'DataFrame' has no attribute 'from_items'

In [21]:
import pandas as pd
data = {'A': [1, 2, 3],'B': [4, 5, 6]}
df = pd.DataFrame.from_dict(data, orient='index', columns=['one', 'two', 'three'])
df

   one  two  three
A    1    2      3
B    4    5      6

## Accessing a Column in a Pandas DataFrame

- df['one'] is used to access a specific column named `'one'` in the DataFrame df.
- It returns a Pandas Series containing all the values in that column.

### Note:
- The column is returned as a Series.
- You can perform operations on it like `.mean(), .sum(), indexing, etc`.

In [22]:
df['one']

A    1
B    4
Name: one, dtype: int64

## Creating a New Column in a DataFrame by Multiplying Two Existing Columns

- This line multiplies the values in `column 'one' with the values in column 'two'`.
- The result is stored in a new or existing column named `'three'`.
- This is a vectorized operation in Pandas (fast and efficient).
- It's commonly used in data analysis to create derived columns.

In [24]:
 df['three'] = df['one'] * df['two']
df

   one  two  three
A    1    2      2
B    4    5     20

## Creating a Boolean Column Based on a Condition

- This line checks whether each value in `column 'one' is greater than 2`.
- The result is a Boolean Series **(True or False)** for each row.
- A new column 'flag' is added to the DataFrame with these `Boolean values`.

### Note:
- This technique is useful for:
- Filtering rows (df[df['flag']])
- Conditional analysis
- Feature engineering in machine learning

In [27]:
 df['flag'] = df['one'] > 2
df

   one  two  three   flag
A    1    2      2  False
B    4    5     20   True

### print a complete data frame

In [28]:
df

   one  two  three   flag
A    1    2      2  False
B    4    5     20   True

## Adding a New Column to a DataFrame

- This line adds a new column called `'foo'` to the existing DataFrame df.
- The value 'bar' will be assigned to `every row in this column`.

In [30]:
df['foo'] = 'bar'
df

   one  two  three   flag  foo
A    1    2      2  False  bar
B    4    5     20   True  bar

### Print complete dataframe

In [31]:
df

   one  two  three   flag  foo
A    1    2      2  False  bar
B    4    5     20   True  bar

### Create a new column with first 2 values only

- df is a DataFrame (a table of data in pandas).
- `df['one']` refers to the column named **'one'** in that DataFrame.
- `[:2]` means "take the **first 2 rows only**".
-` df['one_trunc']` is a new column being created.
- So, this line copies the first 2 values from the 'one' column into a new column called `'one_trunc'`.

In [9]:
import pandas as pd
df = pd.DataFrame({'one': [10, 20, 30, 40, 50]})
df

   one
0   10
1   20
2   30
3   40
4   50

In [10]:
df['one_trunc'] = df['one'][:2]
df

   one  one_trunc
0   10       10.0
1   20       20.0
2   30        NaN
3   40        NaN
4   50        NaN

### Insert a new column into the DataFrame

**Following function has three arguments:**
- 1st: Index where the new column will be inserted.
-  2nd: Label or name of the new column.
-  3rd: The data that will go in the new column.

- df.insert() is used to `insert a new column into an existing DataFrame.`
- 1 ‚Üí The position (index) where the new column will appear (after the first column).
- 'bar3' ‚Üí The name of the new column.
- df['one'] ‚Üí The data copied from the `'one' column.`
- This will create a new column named 'bar2' as the second column in your DataFrame, and it will contain the same values as 'one'.

In [14]:
df.insert(1, 'bar3', df['one'])
df

   one  bar3  bar2  one_trunc
0   10    10    10       10.0
1   20    20    20       20.0
2   30    30    30        NaN
3   40    40    40        NaN
4   50    50    50        NaN

In [17]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'one': [1.0, 2.0, 3.0, np.nan],
    'bar2': [1.0, 2.0, 3.0, np.nan],
    'flag': [False, False, True, False],
    'foo': ['bar', 'bar', 'bar', 'bar'],
    'one_trunc': [1.0, 2.0, np.nan, np.nan]
}, index=['a', 'b', 'c', 'd'])
df

   one  bar2   flag  foo  one_trunc
a  1.0   1.0  False  bar        1.0
b  2.0   2.0  False  bar        2.0
c  3.0   3.0   True  bar        NaN
d  NaN   NaN  False  bar        NaN

### Return the coloumn labels and values on row `label 'b'`

- `df.loc[]` is used to access a row in a DataFrame by its label (index name).
- `'b'` is the index label of the row we want.
- This will return all column values for the row with `index 'b'.`

In [18]:
df.loc['b']

one            2.0
bar2           2.0
flag         False
foo            bar
one_trunc      2.0
Name: b, dtype: object

### Return the values of those coloumns `that is > than 2`

- **df.iloc[]** is used to access a row by its integer position (not by label).
- 2 means we're selecting the 3rd row `(Python uses 0-based indexing).`
- This will return all values from the row at position **2** in the DataFrame.
- This returns a Series with all values from the row at index position **2** (which is labeled 'c').

In [19]:
df.iloc[2]

one           3.0
bar2          3.0
flag         True
foo           bar
one_trunc     NaN
Name: c, dtype: object

### Create a DataFrame with random numbers

- np.random.randn(10, 4) generates a **10√ó4** matrix of random numbers from a standard normal distribution (mean = 0, std = 1).
- pd.DataFrame(...) converts that matrix into a DataFrame.
- `columns=['A', 'B', 'C', 'D']` sets the column names of the DataFrame.

In [21]:
df = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -0.668079 -0.568010  1.584286  0.194381
1  1.454156 -0.192441 -1.191967 -1.304609
2 -1.141268 -0.348573 -0.187496  0.049231
3  0.856891 -0.481908 -3.330206 -0.926746
4  1.684653 -0.560409  1.014237  1.571608
5 -0.347244  0.482195  1.297367 -0.934971
6  1.292717 -0.794334 -1.494072 -0.565153
7  0.514095  1.118541 -0.002435  0.417686
8 -1.089436  0.978827 -0.872100  0.142786
9  0.284130  0.255537  0.994908 -0.989803

In [29]:
df2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])
df2

          A         B         C
0 -1.058752  0.304145  0.776712
1 -0.759193 -1.103176 -0.297034
2 -0.396817  0.694836  0.682874
3  0.282575 -2.296265 -0.427853
4  0.483814  0.705338 -0.669168
5  1.338035  0.060077  0.264538
6 -1.135459  0.770409 -1.105526

### Add values of respective coloumn labels

- This operation adds two DataFrames element-wise.
- Both df and df2 must have some matching columns `(like 'A', 'B', 'C')` and row indices.
- The result will contain:
   - The sum of matching cells from `df and df2.`
   - NaN wherever the column or index does not exist in either DataFrame.

### Notes:
- If df has 10 rows and df2 has 7 rows, only the first 7 rows will be added; the rest will become `NaN.`
- If df has a column 'D' but df2 does not, that column will show as NaN in the result.

In [30]:
df + df2

          A         B         C   D
0 -1.726831 -0.263865  2.360998 NaN
1  0.694964 -1.295617 -1.489001 NaN
2 -1.538085  0.346263  0.495378 NaN
3  1.139466 -2.778174 -3.758059 NaN
4  2.168468  0.144929  0.345069 NaN
5  0.990791  0.542273  1.561905 NaN
6  0.157258 -0.023925 -2.599598 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

### Subtract First Row from All Rows in the DataFrame

- **df.iloc[0]** selects the first row of the DataFrame.
- When we do `df - df.iloc[0]`, pandas subtracts each value in the first row from the corresponding column in every other row.
- This is called row-wise `broadcasting.`
- Subtracts row 0 from each row of the DataFrame.
- The result will have:
  - `0.0` in the first row (because it's row0 - row0)
  - Differences in the remaining rows.

In [31]:
df - df.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  2.122236  0.375569 -2.776253 -1.498990
2 -0.473189  0.219437 -1.771782 -0.145150
3  1.524970  0.086102 -4.914493 -1.121127
4  2.352733  0.007602 -0.570049  1.377227
5  0.320835  1.050206 -0.286919 -1.129352
6  1.960796 -0.226323 -3.078358 -0.759534
7  1.182174  1.686552 -1.586721  0.223305
8 -0.421357  1.546837 -2.456386 -0.051595
9  0.952209  0.823547 -0.589378 -1.184184

### Multiply All Values in DataFrame by 5, Then Add 2

- `df * 5` ‚Üí Multiplies each numeric value in the DataFrame by 5.
- `+ 2` ‚Üí Then adds 2 to each result.
- This operation is applied element-wise on all numeric columns.
- Non-numeric columns (like strings) will be ignored or may cause an error depending on context.

In [32]:
df*5+2

           A         B          C         D
0  -1.340396 -0.840052   9.921431  2.971904
1   9.270782  1.037793  -3.959835 -4.523044
2  -3.706340  0.257133   1.062522  2.246156
3   6.284456 -0.409542 -14.651031 -2.633729
4  10.423267 -0.802044   7.071185  9.858038
5   0.263780  4.410977   8.486837 -2.674855
6   8.463583 -1.971669  -5.470359 -0.825764
7   4.570474  7.592706   1.987825  4.088428
8  -3.447179  6.894133  -2.360499  2.713930
9   3.420648  3.277684   6.974540 -2.949016

### Take the Reciprocal of Each Value in the DataFrame

- This operation performs element-wise division:
   ‚ûù It divides 1 by each value in the DataFrame.
- So every value x becomes **1 / x.**
- This is called taking the `reciprocal of the values.`

### Notes:
- If any value in df is 0, you'll get inf (infinity) or a warning.
- If there are any NaN values, the result will also be NaN in those places.
-  `inf` appears because division by zero is not defined

In [33]:
1 / df

          A         B           C          D
0 -1.496829 -1.760531    0.631199   5.144539
1  0.687684 -5.196389   -0.838949  -0.766513
2 -0.876218 -2.868837   -5.333457  20.312310
3  1.167009 -2.075083   -0.300282  -1.079045
4  0.593594 -1.784412    0.985963   0.636291
5 -2.879819  2.073848    0.770792  -1.069552
6  0.773565 -1.258917   -0.669312  -1.769433
7  1.945167  0.894022 -410.682284   2.394145
8 -0.917906  1.021631   -1.146658   7.003487
9  3.519521  3.913331    1.005118  -1.010302

### Raise Each Value in the DataFrame to the 4th Power

-  `df ** 4` performs an element-wise exponentiation.
-  Each numeric entry x in the DataFrame is replaced by `x‚Å¥`
-  Non-numeric columns will be ignored or will raise an error if they cannot be `exponentiated.`

In [34]:
df **4

          A         B             C         D
0  0.199210  0.104094  6.299915e+00  0.001428
1  4.471410  0.001371  2.018631e+00  2.896818
2  1.696487  0.014763  1.235847e-03  0.000006
3  0.539142  0.053933  1.229942e+02  0.737637
4  8.054569  0.098632  1.058175e+00  6.100654
5  0.014539  0.054062  2.833034e+00  0.764174
6  2.792629  0.398118  4.982941e+00  0.102015
7  0.069851  1.565337  3.515411e-11  0.030437
8  1.408661  0.917958  5.784486e-01  0.000416
9  0.006517  0.004264  9.797870e-01  0.959832

### Create a Boolean DataFrame

- This creates a DataFrame named df1 with two columns: `'a' and 'b'.`
- The values are initially integers **(1 and 0)**, but dtype=bool converts them to Boolean values:
  - 1 becomes True
  - 0 becomes False
- This is useful for logical operations, filtering, and conditions in pandas.

In [35]:
df1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)
df1

       a      b
0   True  False
1  False   True
2   True   True

### Create a Second Boolean DataFrame

- This creates a new Boolean DataFrame named df2 with the same column names **('a' and 'b')** as df1.
- Integer values 1 and 0 are automatically converted to:
  - `1 ‚Üí True`
  - `0 ‚Üí False`
- You can now perform logical operations like df1 & df2, df1 | df2, df1 ^ df2 to compare both DataFrames.

In [36]:
df2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)
df2

       a      b
0  False   True
1   True   True
2   True  False

# Create a Boolean DataFrame (Without Assigning to a Variable)

- This creates a new Boolean DataFrame using a Python dictionary.
- The keys `'a' and 'b'` represent column names.
- The values are lists of integers (0 and 1), but setting dtype=bool converts:
   - `0 ‚Üí False`
   - `1 ‚Üí True`
- Since this is not assigned to a variable (like df or df2), it will only display the result but not store it unless assigned.

In [38]:
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

### Element-wise AND Between Two Boolean DataFrames

- & is the bitwise **AND operator**.
- When used between two Boolean DataFrames (df1 and df2), it performs an element-wise logical AND.
- True & True ‚Üí `True`
- True & False or False & True or False & False ‚Üí `False`
- Only cells where both values are True will result in True

In [39]:
df1 & df2

       a      b
0  False  False
1  False   True
2   True  False

### Element-wise OR Between Two Boolean DataFrames

- | is the bitwise OR operator.
- When used with two Boolean DataFrames (df1 and df2), it performs an element-wise logical OR:
   - `True | True ‚Üí True`
   - `True | False ‚Üí True`
   - `False | True ‚Üí True`
   - `False | False ‚Üí False`
- The result is True wherever at least one of the values is True

In [40]:
df1 | df2

      a     b
0  True  True
1  True  True
2  True  True

### Apply Unary Minus to a Boolean DataFrame

- df1 is a Boolean DataFrame (True and False values).
- Applying - (unary minus) to Boolean values will:
   - `Convert True to -1`
   - `Convert False to 0`
- This is because in Python:
   - `True is treated as 1`
   - `False is treated as 0`
So:
   - `True ‚Üí -1`
   - `False ‚Üí 0`

In [41]:
-df1

       a      b
0  False   True
1   True  False
2  False  False

### Transpose the First 5 Rows of a DataFrame

- **df[:5]** ‚Üí Selects the first 5 rows of the DataFrame (row index 0 to 4).
- .T ‚Üí Transposes the DataFrame:
   - `Rows become columns`
   - `Columns become rows`
- This is useful for:
  - Quickly viewing a column-oriented view of data
  - Plotting, reshaping, or summarizing values column-wise

In [42]:
df[:5].T

          0         1         2         3         4
A -0.668079  1.454156 -1.141268  0.856891  1.684653
B -0.568010 -0.192441 -0.348573 -0.481908 -0.560409
C  1.584286 -1.191967 -0.187496 -3.330206  1.014237
D  0.194381 -1.304609  0.049231 -0.926746  1.571608

### Generate a Range of Dates

- `pd.date_range()` creates a range of dates using pandas.
- '20130101' is the start date ‚Üí **January 1, 2013.**
- periods=6 means it will generate 6 consecutive daily dates.
- The result is a DatetimeIndex object.
- This is commonly used to set row indices in time series DataFrames.

In [44]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

### Create a Time-Indexed DataFrame with Random Values

- `np.random.randn(6, 4)` ‚Üí Generates a 6√ó4 matrix of random numbers from a normal distribution.
- `columns=list('ABCD')` ‚Üí Sets column names to 'A', 'B', 'C', 'D'.
- `index=date`s ‚Üí Sets the row index to the 6 dates previously created using pd.date_range('20130101', periods=6).
-  This is useful for time series analysis where each row corresponds to a date.

In [45]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.038062  0.127745  1.291677 -0.397737
2013-01-02 -1.214732  3.689069  0.457898 -0.236131
2013-01-03 -1.565922 -1.056831 -0.082196 -0.676235
2013-01-04 -1.084125 -0.003558 -0.420026 -0.064182
2013-01-05 -0.367699 -0.586386  0.580085  1.063113
2013-01-06 -0.964908 -0.829860 -2.760746 -0.423406

### Create a DataFrame with Mixed Data Types

- This code creates a DataFrame with **4 rows** and **6 columns**, each containing a **different data type**:

| Column | Description                              | Data Type    |
|--------|------------------------------------------|--------------|
| `'A'`  | Float value `1.0` repeated                | `float64`    |
| `'B'`  | A constant timestamp date (`2013-01-02`) | `datetime64` |
| `'C'`  | A pandas Series with float32 values       | `float32`    |
| `'D'`  | A NumPy array of integers (value 3)       | `int32`      |
| `'E'`  | A categorical column with two labels      | `category`   |
| `'F'`  | A constant string `'foo'`                 | `object`     |

- This is a great example of how pandas can handle heterogeneous data in tabular form.

In [46]:
df2 = pd.DataFrame({ 'A' : 1.,
'B' : pd.Timestamp('20130102'),
'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
'D' : np.array([3] * 4,dtype='int32'),
'E' : pd.Categorical(["test","train","test","train"]),
'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### Check Data Types of Each Column in DataFrame

- This command returns the data type (dtype) of each column in the DataFrame df2.
- It helps you understand what kind of data each column holds, such as:
  - `int64 for integers`
  - `float64 for decimal numbers`
  - `bool for Boolean values`
  - `object for strings or mixed types`
  - `datetime64 for date/time`
- Use this to verify column types before performing operations like math, filtering, or plotting.

In [47]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

### Display the First 5 Rows of a DataFrame

- `df.head()` returns the first 5 rows of the DataFrame df by default.
- It is useful for quickly inspecting the structure and data of a DataFrame especially after loading or creating it.
- You can also pass a number inside head(n) to get the `first n rows.`
- Use df.tail() to view the last `5 rows`

In [48]:
df.head()

                   A         B         C         D
2013-01-01  1.038062  0.127745  1.291677 -0.397737
2013-01-02 -1.214732  3.689069  0.457898 -0.236131
2013-01-03 -1.565922 -1.056831 -0.082196 -0.676235
2013-01-04 -1.084125 -0.003558 -0.420026 -0.064182
2013-01-05 -0.367699 -0.586386  0.580085  1.063113

### Display the Last 3 Rows of a DataFrame

- `df.tail(3)` returns the last 3 rows of the DataFrame df.
- Useful for inspecting recent or bottom-end data in the dataset.
- You can change the number inside tail(n) to get the `last n rows.`
- This is the opposite of df.head(n), which returns the first n rows.

In [49]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.084125 -0.003558 -0.420026 -0.064182
2013-01-05 -0.367699 -0.586386  0.580085  1.063113
2013-01-06 -0.964908 -0.829860 -2.760746 -0.423406

### Display the Index (Row Labels) of the DataFrame

- df.index returns the index object of the DataFrame ‚Äî these are the row labels.
- Index can be:
  - Default integers: `0, 1, 2, ...`
  - Date range (as in time series): `DatetimeIndex`
  - Custom labels set manually
- This index is useful for label-based selection (df.loc[]) and time series operations.

In [50]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

### Display the Column Labels of the DataFrame

- `df.columns` returns the column names (labels) of the DataFrame as an Index object.
- It helps you see or confirm what `features/fields` your DataFrame includes.
- Columns can be strings, numbers, or other hashable types.
- You can use this to rename, reorder, or select columns in your DataFrame.

In [51]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### Display the Underlying Data of the DataFrame as a NumPy Array

- `df.values` returns the actual data stored in the DataFrame as a NumPy array.
- It does not include index or column labels, just the raw values
- The result is a 2D NumPy array: `rows √ó columns.`
- If the DataFrame has mixed data types, `df.values` will return an array with dtype=object.

In [52]:
df.values

array([[ 1.03806169e+00,  1.27745298e-01,  1.29167696e+00,
        -3.97737311e-01],
       [-1.21473172e+00,  3.68906931e+00,  4.57898111e-01,
        -2.36131271e-01],
       [-1.56592154e+00, -1.05683108e+00, -8.21956296e-02,
        -6.76235356e-01],
       [-1.08412451e+00, -3.55839826e-03, -4.20025646e-01,
        -6.41824492e-02],
       [-3.67698642e-01, -5.86386107e-01,  5.80085110e-01,
         1.06311260e+00],
       [-9.64907736e-01, -8.29859999e-01, -2.76074619e+00,
        -4.23405921e-01]])

### Transpose the DataFrame

- `df.T` is the transpose of the DataFrame.
- It swaps rows and columns:
  - `Rows become columns`
  - `Columns become rows`
- It‚Äôs useful when:
- You want to flip the orientation of your data
- You‚Äôre working with time series data and want to view it per column
- You can also use df.transpose() ‚Äî it's the same as `df.T.`

In [53]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.038062   -1.214732   -1.565922   -1.084125   -0.367699   -0.964908
B    0.127745    3.689069   -1.056831   -0.003558   -0.586386   -0.829860
C    1.291677    0.457898   -0.082196   -0.420026    0.580085   -2.760746
D   -0.397737   -0.236131   -0.676235   -0.064182    1.063113   -0.423406

### Sort DataFrame Columns in Reverse Alphabetical Order

- `sort_index()` is used to sort by index labels.
- `axis=1` tells pandas to sort columns (because columns are on axis 1).
- `ascending=False` means the sort will be in descending order (Z ‚Üí A).
- Sorts the column labels in reverse alphabetical order.
- The row data stays the same, only column positions are rearranged.
- Use `axis=0` to sort rows by index, and axis=1 to sort columns by label.

In [54]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.397737  1.291677  0.127745  1.038062
2013-01-02 -0.236131  0.457898  3.689069 -1.214732
2013-01-03 -0.676235 -0.082196 -1.056831 -1.565922
2013-01-04 -0.064182 -0.420026 -0.003558 -1.084125
2013-01-05  1.063113  0.580085 -0.586386 -0.367699
2013-01-06 -0.423406 -2.760746 -0.829860 -0.964908

### Sort the DataFrame by Values in Column 'B'

- **sort_values(by='B')** sorts the rows of the DataFrame df based on the values in column 'B'.
- It arranges the rows in ascending order by default `(lowest to highest).`
- All other `columns` values stay in sync with their rows.

In [55]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -1.565922 -1.056831 -0.082196 -0.676235
2013-01-06 -0.964908 -0.829860 -2.760746 -0.423406
2013-01-05 -0.367699 -0.586386  0.580085  1.063113
2013-01-04 -1.084125 -0.003558 -0.420026 -0.064182
2013-01-01  1.038062  0.127745  1.291677 -0.397737
2013-01-02 -1.214732  3.689069  0.457898 -0.236131

### Generate Descriptive Statistics Summary for the DataFrame

- df.describe() returns a statistical summary of all numeric columns in the DataFrame.
- It helps you quickly understand the distribution and spread of your data.
- Use df.describe(include='all') to get summary stats for all columns, including non-numeric ones.
- Includes the following statistics (by default for numeric columns):

| **Statistic** | **Meaning**                               |
|---------------|--------------------------------------------|
| `count`       | Number of non-null (non-NaN) entries       |
| `mean`        | Average value                              |
| `std`         | Standard deviation (spread of the data)    |
| `min`         | Minimum value                              |
| `25%`         | 1st quartile (Q1)                          |
| `50%`         | Median (2nd quartile or Q2)                |
| `75%`         | 3rd quartile (Q3)                          |
| `max`         | Maximum value                              |

In [56]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.693220  0.223363 -0.155551 -0.122430
std    0.934185  1.759297  1.405298  0.615616
min   -1.565922 -1.056831 -2.760746 -0.676235
25%   -1.182080 -0.768992 -0.335568 -0.416989
50%   -1.024516 -0.294972  0.187851 -0.316934
75%   -0.517001  0.094919  0.549538 -0.107170
max    1.038062  3.689069  1.291677  1.063113

### Select a Single Column from the DataFrame

- This selects column `'A'` from the DataFrame df.
- The result is a pandas Series, not a DataFrame.
- You can perform operations, analysis, or visualizations on this `single column.`
- Use `df[['A']]` (with double brackets) if you want the result as a DataFrame instead of a Series.

In [57]:
df['A']

2013-01-01    1.038062
2013-01-02   -1.214732
2013-01-03   -1.565922
2013-01-04   -1.084125
2013-01-05   -0.367699
2013-01-06   -0.964908
Freq: D, Name: A, dtype: float64

### Select Rows by Integer Position (Slicing)

- This uses row slicing to return rows **0, 1, and 2** (Python slicing is exclusive of the end index)
- It's similar to how you slice lists or arrays in Python: start:stop
- The result is a new DataFrame containing the selected rows.
- This is position-based selection. For label-based row slicing, `use .loc[].`

In [58]:
df[0:3]

                   A         B         C         D
2013-01-01  1.038062  0.127745  1.291677 -0.397737
2013-01-02 -1.214732  3.689069  0.457898 -0.236131
2013-01-03 -1.565922 -1.056831 -0.082196 -0.676235

### Select Rows by Date Range Using Label-Based Indexing

- This selects rows from the DataFrame df where the index is a date between:
  - `'2013-01-02' (inclusive)` 
  - `'2013-01-04' (inclusive)`
- Works only if the DataFrame has a DatetimeIndex.
- This is an example of label-based slicing using row index labels.
-  Unlike standard Python slicing, pandas includes the end date when slicing by labels.

In [59]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.214732  3.689069  0.457898 -0.236131
2013-01-03 -1.565922 -1.056831 -0.082196 -0.676235
2013-01-04 -1.084125 -0.003558 -0.420026 -0.064182

### Select Specific Columns Using `loc`

- `df.loc[]` is used for label-based selection.
- The syntax df.loc[rows, columns] allows you to select:
  - Specific rows by label
  - Specific columns by name
- In this example:
  - **:** means all rows
  - **['A', 'B']** means select only columns 'A' and 'B'

In [60]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  1.038062  0.127745
2013-01-02 -1.214732  3.689069
2013-01-03 -1.565922 -1.056831
2013-01-04 -1.084125 -0.003558
2013-01-05 -0.367699 -0.586386
2013-01-06 -0.964908 -0.829860

### Label-Based Slicing with Column Selection

- df.loc[] is used for label-based selection.
- This example selects:
  - Rows from 2013-01-02 to 2013-01-04 `(both inclusive ‚úÖ)`
  - Only columns `'A' and 'B'`

In [61]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.214732  3.689069
2013-01-03 -1.565922 -1.056831
2013-01-04 -1.084125 -0.003558

### Select Specific Columns from a Specific Row (Label-Based)

- df.loc[] is used for label-based selection.
- This code selects:
  - `A single row with the label '2013-01-02'`
  - `Only columns 'A' and 'B'`
- `'20130102'`	Row label (a specific date index)
- `['A', 'B']` List of column labels to select

In [62]:
df.loc['20130102',['A','B']]

A   -1.214732
B    3.689069
Name: 2013-01-02 00:00:00, dtype: float64

### Access a Single Cell by Label (Row + Column)

- `df.loc[]` allows label-based access to data.
- Here, you're selecting:
  - A single row using dates[0] (e.g., '2013-01-01')
  - A single column 'A'
- The result is a scalar value (a single data point)
- `dates[0]`	The first date in the DatetimeIndex (e.g., '2013-01-01')
- `'A'`	Column label

In [63]:
df.loc[dates[0],'A']

np.float64(1.0380616905730706)

### Select a Row by Integer Position

- `df.iloc[]` is used for position-based selection.
- This code selects the `4th row` of the DataFrame df (Python uses 0-based indexing, so index 3 is the 4th row).
- The result is a pandas Series containing all the values from that row.
- `iloc[3]`	Get row at index position 3
- Use .iloc[] when selecting by row/column position, not by labels.

In [64]:
df.iloc[3]

A   -1.084125
B   -0.003558
C   -0.420026
D   -0.064182
Name: 2013-01-04 00:00:00, dtype: float64

### Select a Range of Rows and Columns Using `.iloc`

- `.iloc[]` is used for integer position-based selection (like Python lists).
- This code selects:
  - Rows at index positions `3 and 4` (remember, end is exclusive ‚Üí 3:5 gives rows 3 & 4)
  - Columns at index positions `0 and 1` (so columns 'A' and 'B' if that's the order)
- 3:5	Rows 3 and 4 (end index 5 is excluded)
- 0:2	Columns 0 and 1 (usually 'A' and 'B')

In [65]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.084125 -0.003558
2013-01-05 -0.367699 -0.586386

### Select Specific Rows and Columns by Integer Position

- .iloc[] is used for position-based indexing (like arrays).
- This code selects:
  - `Rows at positions 1, 2, and 4`
  - `Columns at positions 0 and 2`
- [1, 2, 4]	2nd, 3rd, and 5th rows (index-based)
- [0, 2]	1st and 3rd columns (e.g., 'A' & 'C')

In [66]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.214732  0.457898
2013-01-03 -1.565922 -0.082196
2013-01-05 -0.367699  0.580085

### Select All Rows and a Range of Columns Using `.iloc`

- .iloc[] is used for integer-based indexing.
- This code selects:
   - `All rows (:)`
   - `Columns at positions 1 and 2` (Python slicing is end-exclusive ‚Üí 1:3)
- **:**	Selects all rows
- **1:3**	Selects columns at index 1 and 2
- Use .iloc when selecting by column/row position, not by label.

In [67]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.127745  1.291677
2013-01-02  3.689069  0.457898
2013-01-03 -1.056831 -0.082196
2013-01-04 -0.003558 -0.420026
2013-01-05 -0.586386  0.580085
2013-01-06 -0.829860 -2.760746

### Access a Single Value by Row and Column Position

- .iloc[row_index, column_index] is used for position-based access.
- This retrieves the value at:
   - `Row position 1 (i.e., the second row)`
   - `Column position 1 (i.e., the second column)`
- Argument	Refers To
- 1 (row)	Second row in the DataFrame
- 1 (column)	Second column in the DataFrame

In [68]:
df.iloc[1,1]

np.float64(3.689069306461895)

### Filter Rows Where Column 'A' Has Positive Values

- This is a boolean indexing operation.
- It returns only the rows in the DataFrame df where the value in `column 'A' is greater than 0`.
- `df.A > 0` creates a Boolean Series (True or False for each row), **and df[...]**filters the DataFrame accordingly.
- df.A	Selects column 'A'
- df.A > 0	Creates a boolean condition (True/False)
- df[...]	Filters rows where the condition is True
- You can apply any condition inside the brackets to filter your DataFrame.

In [69]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.038062  0.127745  1.291677 -0.397737

### Return Only Positive Values from the DataFrame

- This applies a boolean condition **(df > 0)** to the entire DataFrame.
- It checks every cell, and:
  - `Keeps the value if it's > 0`
  - `Replaces it with NaN if it's not > 0`
- The result is a new DataFrame of the same shape, but with non-matching values replaced by `NaN.`
- df > 0	Returns a DataFrame of True/False
- df[...]	Keeps values where condition is True; others become NaN

In [70]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.038062  0.127745  1.291677       NaN
2013-01-02       NaN  3.689069  0.457898       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04       NaN       NaN       NaN       NaN
2013-01-05       NaN       NaN  0.580085  1.063113
2013-01-06       NaN       NaN       NaN       NaN

### Create a Copy of a DataFrame

- `df.copy()` creates a deep copy of the DataFrame df.
- df2 becomes an independent copy ‚Äî changes made to ``df2 will not affect the original df.
- This is important when you want to preserve the original data while experimenting or modifying a copy.
- Use `.copy()` whenever you need to safely modify a new version of your DataFrame without affecting the original.

In [72]:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01  1.038062  0.127745  1.291677 -0.397737
2013-01-02 -1.214732  3.689069  0.457898 -0.236131
2013-01-03 -1.565922 -1.056831 -0.082196 -0.676235
2013-01-04 -1.084125 -0.003558 -0.420026 -0.064182
2013-01-05 -0.367699 -0.586386  0.580085  1.063113
2013-01-06 -0.964908 -0.829860 -2.760746 -0.423406

### Add a New Column to the DataFrame

- This adds a new column named `'E' to the DataFrame df2.`
- The values in the new column are taken from the provided list of strings.
- Each element in the list is assigned to the corresponding row in the DataFrame.

### Note 
- The length of the list must match the number of rows in df2 (in this case, 6 rows).
- If the lengths don't match, you'll get a ValueError.

In [73]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  1.038062  0.127745  1.291677 -0.397737    one
2013-01-02 -1.214732  3.689069  0.457898 -0.236131    one
2013-01-03 -1.565922 -1.056831 -0.082196 -0.676235    two
2013-01-04 -1.084125 -0.003558 -0.420026 -0.064182  three
2013-01-05 -0.367699 -0.586386  0.580085  1.063113   four
2013-01-06 -0.964908 -0.829860 -2.760746 -0.423406  three

### Filter Rows Where Column `'E'` Has Values `'two'` or `'four'`

- This code returns rows from DataFrame f2 where the corresponding value in df2['E'] is either `'two' or 'four'.`
- The method .isin([...]) checks each value in column 'E' against the provided list and returns `True or False.`
- df2['E']	Accesses column 'E' in df2
- .isin(['two', 'four'])	Returns a Boolean Series for values 'two'/'four'
- f2[...]	Filters f2 rows where the condition is True
- .isin() is useful for filtering by multiple matching values in one line.

In [74]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.565922 -1.056831 -0.082196 -0.676235   two
2013-01-05 -0.367699 -0.586386  0.580085  1.063113  four